#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary><strong>Validation Output</strong></summary>

```<br />
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary><strong>Show Plan</strong></summary>

``` <br />
terraform
data.azurerm_client_config.current: Reading...
module.rg.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNGZhMzFiNS00ZjVlLTQzYWYtYWMwOS1iMmI5M2Y0MjNkNmY7b2JqZWN0SWQ9MjBkYjVmZTItZjhiYy00Y2ZiLTg4YjQtZjVjYjlkMDMyNDA1O3N1YnNjcmlwdGlvbklkPWY5MGI0MTIxLTU3ZjEtNGRiNi1hZGU2LTNiMTJlYTkzMGE2Njt0ZW5hbnRJZD1lOTk0MDcyYi01MjNlLTRiZmUtODZlMi00NDJjNWUxMGIyNDQ=]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto]
module.pubip.azurerm_public_ip.pubip: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/publicIPAddresses/pubip-twitter-auto]
module.nsg.azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto]
module.cr.azurerm_container_registry.cr: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerRegistry/registries/crTwitterAuto]
module.sa.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Storage/storageAccounts/mysonarqubestorage]
module.aks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerService/managedClusters/aks-twitter-auto]
module.snet.azurerm_subnet.snet: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto/subnets/snet-twitter-auto]
module.ni.azurerm_network_interface.ni: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto]
module.nisga.azurerm_network_interface_security_group_association.nisga: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto|/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto]
module.ss.azurerm_storage_share.ss: Refreshing state... [id=https://mysonarqubestorage.file.core.windows.net/mysonarqubedata]
module.cg.azurerm_container_group.cg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerInstance/containerGroups/mysonarcube]
data.azurerm_kubernetes_cluster.cluster: Reading...
data.azurerm_kubernetes_cluster.cluster: Read complete after 2s [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerService/managedClusters/aks-twitter-auto]
module.helm.helm_release.kube-prometheus: Refreshing state... [id=kube-prometheus-stackr]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.helm.helm_release.ingress will be created
  + resource "helm_release" "ingress" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress"
      + namespace                  = "kube-public"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "4.5.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.kube-prometheus will be destroyed
  # (because helm_release.kube-prometheus is not in configuration)
  - resource "helm_release" "kube-prometheus" {
      - atomic                     = false -> null
      - chart                      = "kube-prometheus-stack" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "kube-prometheus-stackr" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "0.57.0"
              - chart       = "kube-prometheus-stack"
              - name        = "kube-prometheus-stackr"
              - namespace   = "kube-public"
              - revision    = 1
              - values      = jsonencode({})
              - version     = "36.2.0"
            },
        ] -> null
      - name                       = "kube-prometheus-stackr" -> null
      - namespace                  = "kube-public" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://prometheus-community.github.io/helm-charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "36.2.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @cuatrosr, Action: `pull_request`, Workflow: `On Pull Request`*